wsmitpwtind/Buaa_QiXian_Cup/stm32_lib/stm32f10x_Reg.h
/*
以下代码实现：（需要配置FSMC）
操作（读写）LCD_REG  这个虚拟寄存器则操作LCE内部寄存器，即操作的是命令
操作（读写）LCD_GRAM 这个虚拟寄存器则操作LCE内部数据暂存器，即操作的是数据
*/

//-------神舟开发板上外部LCD操作地址-----选用了BANK1的第4个FSMC，64M--------
#define LCD_REG    *(volatile unsigned short int *)(0x6C000000) //操作的是LCD的寄存器
#define LCD_GRAM   *(volatile unsigned short int *)(0x6C000002) //操作的是LCD的GRAM,因为是16位数据总线，内部HADD（25~1）和FSMC_ADD(24~0)意义对应



//----------计算真是的IO寄存器---------------如 GPIOA_CRL 就是代表寄存器，可以直接访问的！！

#define GPIOA_CRL      (*(volatile unsigned long *)(GPIOA_BASE+0x00)) 
#define GPIOA_CRH      (*(volatile unsigned long *)(GPIOA_BASE+0x04)) 
#define GPIOA_IDR      (*(volatile unsigned long *)(GPIOA_BASE+0x08))
#define GPIOA_ODR      (*(volatile unsigned long *)(GPIOA_BASE+0x0c))
#define GPIOA_BSRR     (*(volatile unsigned long *)(GPIOA_BASE+0x10))
#define GPIOA_BRR      (*(volatile unsigned long *)(GPIOA_BASE+0x14))
#define GPIOA_LCKR     (*(volatile unsigned long *)(GPIOA_BASE+0x18))


#define GPIOB_CRL      (*(volatile unsigned long *)(GPIOB_BASE+0x00)) 
#define GPIOB_CRH      (*(volatile unsigned long *)(GPIOB_BASE+0x04))
#define GPIOB_IDR      (*(volatile unsigned long *)(GPIOB_BASE+0x08))
#define GPIOB_ODR      (*(volatile unsigned long *)(GPIOB_BASE+0x0c))
#define GPIOB_BSRR     (*(volatile unsigned long *)(GPIOB_BASE+0x10))
#define GPIOB_BRR      (*(volatile unsigned long *)(GPIOB_BASE+0x14))
#define GPIOB_LCKR     (*(volatile unsigned long *)(GPIOB_BASE+0x18))

#define GPIOC_CRL      (*(volatile unsigned long *)(GPIOC_BASE+0x00)) 
#define GPIOC_CRH      (*(volatile unsigned long *)(GPIOC_BASE+0x04)) 
#define GPIOC_IDR      (*(volatile unsigned long *)(GPIOC_BASE+0x08))
#define GPIOC_ODR      (*(volatile unsigned long *)(GPIOC_BASE+0x0c))
#define GPIOC_BSRR     (*(volatile unsigned long *)(GPIOC_BASE+0x10))
#define GPIOC_BRR      (*(volatile unsigned long *)(GPIOC_BASE+0x14))
#define GPIOC_LCKR     (*(volatile unsigned long *)(GPIOC_BASE+0x18))

#define GPIOD_CRL      (*(volatile unsigned long *)(GPIOD_BASE+0x00)) 
#define GPIOD_CRH      (*(volatile unsigned long *)(GPIOD_BASE+0x04))
#define GPIOD_IDR      (*(volatile unsigned long *)(GPIOD_BASE+0x08))
#define GPIOD_ODR      (*(volatile unsigned long *)(GPIOD_BASE+0x0c))
#define GPIOD_BSRR     (*(volatile unsigned long *)(GPIOD_BASE+0x10))
#define GPIOD_BRR      (*(volatile unsigned long *)(GPIOD_BASE+0x14))
#define GPIOD_LCKR     (*(volatile unsigned long *)(GPIOD_BASE+0x18))

#define GPIOE_CRL      (*(volatile unsigned long *)(GPIOE_BASE+0x00)) 
#define GPIOE_CRH      (*(volatile unsigned long *)(GPIOE_BASE+0x04))
#define GPIOE_IDR      (*(volatile unsigned long *)(GPIOE_BASE+0x08))
#define GPIOE_ODR      (*(volatile unsigned long *)(GPIOE_BASE+0x0c))
#define GPIOE_BSRR     (*(volatile unsigned long *)(GPIOE_BASE+0x10))
#define GPIOE_BRR      (*(volatile unsigned long *)(GPIOE_BASE+0x14))
#define GPIOE_LCKR     (*(volatile unsigned long *)(GPIOE_BASE+0x18))

#define GPIOF_CRL      (*(volatile unsigned long *)(GPIOF_BASE+0x00)) 
#define GPIOF_CRH      (*(volatile unsigned long *)(GPIOF_BASE+0x04))
#define GPIOF_IDR      (*(volatile unsigned long *)(GPIOF_BASE+0x08))
#define GPIOF_ODR      (*(volatile unsigned long *)(GPIOF_BASE+0x0c))
#define GPIOF_BSRR     (*(volatile unsigned long *)(GPIOF_BASE+0x10))
#define GPIOF_BRR      (*(volatile unsigned long *)(GPIOF_BASE+0x14))
#define GPIOF_LCKR     (*(volatile unsigned long *)(GPIOF_BASE+0x18))

#define GPIOG_CRL      (*(volatile unsigned long *)(GPIOG_BASE+0x00)) 
#define GPIOG_CRH      (*(volatile unsigned long *)(GPIOG_BASE+0x04))
#define GPIOG_IDR      (*(volatile unsigned long *)(GPIOG_BASE+0x08))
#define GPIOG_ODR      (*(volatile unsigned long *)(GPIOG_BASE+0x0c))
#define GPIOG_BSRR     (*(volatile unsigned long *)(GPIOG_BASE+0x10))
#define GPIOG_BRR      (*(volatile unsigned long *)(GPIOG_BASE+0x14))
#define GPIOG_LCKR     (*(volatile unsigned long *)(GPIOG_BASE+0x18))

#define AFIO_EVCE        (*(volatile unsigned long *)(AFIO_BASE+0x00))
#define AFIO_MAPR        (*(volatile unsigned long *)(AFIO_BASE+0x04))
#define AFIO_EXTICR1     (*(volatile unsigned long *)(AFIO_BASE+0x08))
#define AFIO_EXTICR2     (*(volatile unsigned long *)(AFIO_BASE+0x0C))
#define AFIO_EXTICR3     (*(volatile unsigned long *)(AFIO_BASE+0x10))
#define AFIO_EXTICR4     (*(volatile unsigned long *)(AFIO_BASE+0x14))


#define EXTI_IMR    (*(volatile unsigned long *)(EXTI_BASE+0x00))
#define EXTI_EMR    (*(volatile unsigned long *)(EXTI_BASE+0x04))
#define EXTI_RTSR   (*(volatile unsigned long *)(EXTI_BASE+0x08))
#define EXTI_FTSR   (*(volatile unsigned long *)(EXTI_BASE+0x0C))
#define EXTI_SWIER  (*(volatile unsigned long *)(EXTI_BASE+0x10))
#define EXTI_PR     (*(volatile unsigned long *)(EXTI_BASE+0x14))


//------------系统滴答时钟-----------
#define SysTick_CTRL   (*(volatile unsigned long *)(SysTick_BASE+0))
#define SysTick_LOAD   (*(volatile unsigned long *)(SysTick_BASE+4))
#define SysTick_VAL    (*(volatile unsigned long *)(SysTick_BASE+8))
#define SysTick_CALIB  (*(volatile unsigned long *)(SysTick_BASE+12))


//--------FLASH相关------

#define FLASH_ACR 		 (*(volatile unsigned long *)(0x40022000+0))
#define FLASH_KEYR 	 	 (*(volatile unsigned long *)(0x40022000+4))
#define FLASH_OPTKEYR 	 (*(volatile unsigned long *)(0x40022000+8))
#define FLASH_SR 	 	 (*(volatile unsigned long *)(0x40022000+12))
#define FLASH_CR	     (*(volatile unsigned long *)(0x40022000+16))
#define FLASH_AR 	 	 (*(volatile unsigned long *)(0x40022000+20))

#define FLASH_OBR 	 	 (*(volatile unsigned long *)(0x40022000+28))
#define FLASH_WRPR 	 	 (*(volatile unsigned long *)(0x40022000+32))

//#define FLASH_WRPR 	 	 (*(volatile unsigned long *)(FLASH_R_BASE+32))



//------------电源控制寄存器--------
#define PWR_CR   (*(volatile unsigned long *)(PWR_BASE+0x00))
#define PWR_CSR  (*(volatile unsigned long *)(PWR_BASE+0x04))


//-----------备份区-----------------

#define BKP_DR1     (*(volatile unsigned long *)(BKP_BASE+4))
#define BKP_DR2     (*(volatile unsigned long *)(BKP_BASE+8))
#define BKP_DR3     (*(volatile unsigned long *)(BKP_BASE+12))
#define BKP_DR4     (*(volatile unsigned long *)(BKP_BASE+16))
#define BKP_DR5     (*(volatile unsigned long *)(BKP_BASE+20))
#define BKP_DR6     (*(volatile unsigned long *)(BKP_BASE+24))
#define BKP_DR7     (*(volatile unsigned long *)(BKP_BASE+28))
#define BKP_DR8     (*(volatile unsigned long *)(BKP_BASE+32))
#define BKP_DR9     (*(volatile unsigned long *)(BKP_BASE+36))
#define BKP_DR10    (*(volatile unsigned long *)(BKP_BASE+40))
#define BKP_DR11    (*(volatile unsigned long *)(BKP_BASE+64))
#define BKP_DR12    (*(volatile unsigned long *)(BKP_BASE+68))
#define BKP_DR13    (*(volatile unsigned long *)(BKP_BASE+72))
#define BKP_DR14    (*(volatile unsigned long *)(BKP_BASE+76))
#define BKP_DR15    (*(volatile unsigned long *)(BKP_BASE+80))
#define BKP_DR16    (*(volatile unsigned long *)(BKP_BASE+84))
#define BKP_DR17    (*(volatile unsigned long *)(BKP_BASE+88))
#define BKP_DR18    (*(volatile unsigned long *)(BKP_BASE+92))
#define BKP_DR19    (*(volatile unsigned long *)(BKP_BASE+96))
#define BKP_DR20    (*(volatile unsigned long *)(BKP_BASE+100))
#define BKP_DR21    (*(volatile unsigned long *)(BKP_BASE+104))
#define BKP_DR22    (*(volatile unsigned long *)(BKP_BASE+108))
#define BKP_DR23    (*(volatile unsigned long *)(BKP_BASE+112))
#define BKP_DR24    (*(volatile unsigned long *)(BKP_BASE+116))
#define BKP_DR25    (*(volatile unsigned long *)(BKP_BASE+120))
#define BKP_DR26    (*(volatile unsigned long *)(BKP_BASE+124))
#define BKP_DR27    (*(volatile unsigned long *)(BKP_BASE+128))
#define BKP_DR28    (*(volatile unsigned long *)(BKP_BASE+132))
#define BKP_DR29    (*(volatile unsigned long *)(BKP_BASE+136))
#define BKP_DR30    (*(volatile unsigned long *)(BKP_BASE+140))
#define BKP_DR31    (*(volatile unsigned long *)(BKP_BASE+144))
#define BKP_DR32    (*(volatile unsigned long *)(BKP_BASE+148))
#define BKP_DR33    (*(volatile unsigned long *)(BKP_BASE+152))
#define BKP_DR34    (*(volatile unsigned long *)(BKP_BASE+156))
#define BKP_DR35    (*(volatile unsigned long *)(BKP_BASE+160))
#define BKP_DR36    (*(volatile unsigned long *)(BKP_BASE+164))
#define BKP_DR37    (*(volatile unsigned long *)(BKP_BASE+168))
#define BKP_DR38    (*(volatile unsigned long *)(BKP_BASE+172))
#define BKP_DR39    (*(volatile unsigned long *)(BKP_BASE+176))
#define BKP_DR40    (*(volatile unsigned long *)(BKP_BASE+180))
#define BKP_DR41    (*(volatile unsigned long *)(BKP_BASE+184))
#define BKP_DR42    (*(volatile unsigned long *)(BKP_BASE+188))

#define BKP_RTCCR    (*(volatile unsigned long *)(BKP_BASE+44))
#define BKP_CR       (*(volatile unsigned long *)(BKP_BASE+48))
#define BKP_CSR      (*(volatile unsigned long *)(BKP_BASE+52))

