wsmitpwtind/Buaa_QiXian_Cup/stm32_lib/stm32f10x_Reg.h
//-------------复位和时钟控制-----------------//

#define RCC_CR          (*(volatile unsigned long *)(RCC_BASE+0))
#define RCC_CFGR        (*(volatile unsigned long *)(RCC_BASE+4))
#define RCC_CIR         (*(volatile unsigned long *)(RCC_BASE+8))
#define RCC_APB2RSTR    (*(volatile unsigned long *)(RCC_BASE+12))
#define RCC_APB1RSTR    (*(volatile unsigned long *)(RCC_BASE+16))
#define RCC_AHBENR      (*(volatile unsigned long *)(RCC_BASE+20))
#define RCC_APB2ENR     (*(volatile unsigned long *)(RCC_BASE+24))
#define RCC_APB1ENR     (*(volatile unsigned long *)(RCC_BASE+28))
#define RCC_BDCR        (*(volatile unsigned long *)(RCC_BASE+32))
#define RCC_CSR         (*(volatile unsigned long *)(RCC_BASE+36))

//---------USART---------------------------------------

#define USART1_SR          (*(volatile unsigned long *)(USART1_BASE+0))
#define USART1_DR          (*(volatile unsigned long *)(USART1_BASE+4))
#define USART1_BRR         (*(volatile unsigned long *)(USART1_BASE+8))
#define USART1_CR1         (*(volatile unsigned long *)(USART1_BASE+12))
#define USART1_CR2         (*(volatile unsigned long *)(USART1_BASE+16))
#define USART1_CR3         (*(volatile unsigned long *)(USART1_BASE+20))
#define USART1_GTPR        (*(volatile unsigned long *)(USART1_BASE+24))

#define USART2_SR          (*(volatile unsigned long *)(USART2_BASE+0))
#define USART2_DR          (*(volatile unsigned long *)(USART2_BASE+4))
#define USART2_BRR         (*(volatile unsigned long *)(USART2_BASE+8))
#define USART2_CR1         (*(volatile unsigned long *)(USART2_BASE+12))
#define USART2_CR2         (*(volatile unsigned long *)(USART2_BASE+16))
#define USART2_CR3         (*(volatile unsigned long *)(USART2_BASE+20))
#define USART2_GTPR        (*(volatile unsigned long *)(USART2_BASE+24))

#define USART3_SR          (*(volatile unsigned long *)(USART3_BASE+0))
#define USART3_DR          (*(volatile unsigned long *)(USART3_BASE+4))
#define USART3_BRR         (*(volatile unsigned long *)(USART3_BASE+8))
#define USART3_CR1         (*(volatile unsigned long *)(USART3_BASE+12))
#define USART3_CR2         (*(volatile unsigned long *)(USART3_BASE+16))
#define USART3_CR3         (*(volatile unsigned long *)(USART3_BASE+20))
#define USART3_GTPR        (*(volatile unsigned long *)(USART3_BASE+24))


#define USART4_SR          (*(volatile unsigned long *)(UART4_BASE+0))
#define USART4_DR          (*(volatile unsigned long *)(UART4_BASE+4))
#define USART4_BRR         (*(volatile unsigned long *)(UART4_BASE+8))
#define USART4_CR1         (*(volatile unsigned long *)(UART4_BASE+12))
#define USART4_CR2         (*(volatile unsigned long *)(UART4_BASE+16))
#define USART4_CR3         (*(volatile unsigned long *)(UART4_BASE+20))
#define USART4_GTPR        (*(volatile unsigned long *)(UART4_BASE+24))


#define USART5_SR          (*(volatile unsigned long *)(UART5_BASE+0))
#define USART5_DR          (*(volatile unsigned long *)(UART5_BASE+4))
#define USART5_BRR         (*(volatile unsigned long *)(UART5_BASE+8))
#define USART5_CR1         (*(volatile unsigned long *)(UART5_BASE+12))
#define USART5_CR2         (*(volatile unsigned long *)(UART5_BASE+16))
#define USART5_CR3         (*(volatile unsigned long *)(UART5_BASE+20))
#define USART5_GTPR        (*(volatile unsigned long *)(UART5_BASE+24))


//---------------DMA1-----------------------------------
#define DMA1_ISR        (*(volatile unsigned long *)(DMA1_BASE+0X00))
#define DMA1_IFCR       (*(volatile unsigned long *)(DMA1_BASE+0x04))

#define DMA1_CCR1        (*(volatile unsigned long *)(DMA1_BASE+0x08))
#define DMA1_CNDTR1      (*(volatile unsigned long *)(DMA1_BASE+0x0c))
#define DMA1_CPAR1       (*(volatile unsigned long *)(DMA1_BASE+0x10))
#define DMA1_CMAR1       (*(volatile unsigned long *)(DMA1_BASE+0x14))

#define DMA1_CCR2        (*(volatile unsigned long *)(DMA1_BASE+0x1c))
#define DMA1_CNDTR2      (*(volatile unsigned long *)(DMA1_BASE+0x20))
#define DMA1_CPAR2       (*(volatile unsigned long *)(DMA1_BASE+0x24))
#define DMA1_CMAR2       (*(volatile unsigned long *)(DMA1_BASE+0x28))

#define DMA1_CCR3        (*(volatile unsigned long *)(DMA1_BASE+0x30))
#define DMA1_CNDTR3      (*(volatile unsigned long *)(DMA1_BASE+0x34))
#define DMA1_CPAR3       (*(volatile unsigned long *)(DMA1_BASE+0x38))
#define DMA1_CMAR3       (*(volatile unsigned long *)(DMA1_BASE+0x3c))

#define DMA1_CCR4        (*(volatile unsigned long *)(DMA1_BASE+0x44))
#define DMA1_CNDTR4      (*(volatile unsigned long *)(DMA1_BASE+0x48))
#define DMA1_CPAR4       (*(volatile unsigned long *)(DMA1_BASE+0x4c))
#define DMA1_CMAR4       (*(volatile unsigned long *)(DMA1_BASE+0x50))

#define DMA1_CCR5        (*(volatile unsigned long *)(DMA1_BASE+0x58))
#define DMA1_CNDTR5      (*(volatile unsigned long *)(DMA1_BASE+0x5c))
#define DMA1_CPAR5       (*(volatile unsigned long *)(DMA1_BASE+0x60))
#define DMA1_CMAR5       (*(volatile unsigned long *)(DMA1_BASE+0x64))

#define DMA1_CCR6        (*(volatile unsigned long *)(DMA1_BASE+0x6c))
#define DMA1_CNDTR6      (*(volatile unsigned long *)(DMA1_BASE+0x70))
#define DMA1_CPAR6       (*(volatile unsigned long *)(DMA1_BASE+0x74))
#define DMA1_CMAR6       (*(volatile unsigned long *)(DMA1_BASE+0x78))

#define DMA1_CCR7        (*(volatile unsigned long *)(DMA1_BASE+0x80))
#define DMA1_CNDTR7      (*(volatile unsigned long *)(DMA1_BASE+0x84))
#define DMA1_CPAR7       (*(volatile unsigned long *)(DMA1_BASE+0x88))
#define DMA1_CMAR7       (*(volatile unsigned long *)(DMA1_BASE+0x8c))

//-----------MDA2--------
#define DMA2_ISR        (*(volatile unsigned long *)(DMA2_BASE+0X00))
#define DMA2_IFCR       (*(volatile unsigned long *)(DMA2_BASE+0x04))

#define DMA2_CCR1        (*(volatile unsigned long *)(DMA2_BASE+0x08))
#define DMA2_CNDTR1      (*(volatile unsigned long *)(DMA2_BASE+0x0c))
#define DMA2_CPAR1       (*(volatile unsigned long *)(DMA2_BASE+0x10))
#define DMA2_CMAR1       (*(volatile unsigned long *)(DMA2_BASE+0x14))
		
#define DMA2_CCR2        (*(volatile unsigned long *)(DMA2_BASE+0x1c))
#define DMA2_CNDTR2      (*(volatile unsigned long *)(DMA2_BASE+0x20))
#define DMA2_CPAR2       (*(volatile unsigned long *)(DMA2_BASE+0x24))
#define DMA2_CMAR2       (*(volatile unsigned long *)(DMA2_BASE+0x28))

#define DMA2_CCR3        (*(volatile unsigned long *)(DMA2_BASE+0x30))
#define DMA2_CNDTR3      (*(volatile unsigned long *)(DMA2_BASE+0x34))
#define DMA2_CPAR3       (*(volatile unsigned long *)(DMA2_BASE+0x38))
#define DMA2_CMAR3       (*(volatile unsigned long *)(DMA2_BASE+0x3c))

#define DMA2_CCR4        (*(volatile unsigned long *)(DMA2_BASE+0x44))
#define DMA2_CNDTR4      (*(volatile unsigned long *)(DMA2_BASE+0x48))
#define DMA2_CPAR4       (*(volatile unsigned long *)(DMA2_BASE+0x4c))
#define DMA2_CMAR4       (*(volatile unsigned long *)(DMA2_BASE+0x50))

#define DMA2_CCR5        (*(volatile unsigned long *)(DMA2_BASE+0x58))
#define DMA2_CNDTR5      (*(volatile unsigned long *)(DMA2_BASE+0x5c))
#define DMA2_CPAR5       (*(volatile unsigned long *)(DMA2_BASE+0x60))
#define DMA2_CMAR5       (*(volatile unsigned long *)(DMA2_BASE+0x64))
//-----------------------------------------------------------------------




