wsmitpwtind/Buaa_QiXian_Cup/stm32_lib/stm32f10x_Reg.h
//----------------ADC1转换---------------

#define ADC1_SR          (*(volatile unsigned long *)(ADC1_BASE+0x00))
#define ADC1_CR1         (*(volatile unsigned long *)(ADC1_BASE+0x04))
#define ADC1_CR2         (*(volatile unsigned long *)(ADC1_BASE+0x08))
#define ADC1_SMPR1       (*(volatile unsigned long *)(ADC1_BASE+0x0C))
#define ADC1_SMPR2       (*(volatile unsigned long *)(ADC1_BASE+0x10))
#define ADC1_JOFR1       (*(volatile unsigned long *)(ADC1_BASE+0x14))
#define ADC1_JOFR2       (*(volatile unsigned long *)(ADC1_BASE+0x18))
#define ADC1_JOFR3       (*(volatile unsigned long *)(ADC1_BASE+0x1C))
#define ADC1_JOFR4       (*(volatile unsigned long *)(ADC1_BASE+0x20))
#define ADC1_HTR         (*(volatile unsigned long *)(ADC1_BASE+0x24))
#define ADC1_LTR         (*(volatile unsigned long *)(ADC1_BASE+0x28))
#define ADC1_SQR1        (*(volatile unsigned long *)(ADC1_BASE+0x2C))
#define ADC1_SQR2        (*(volatile unsigned long *)(ADC1_BASE+0x30))
#define ADC1_SQR3        (*(volatile unsigned long *)(ADC1_BASE+0x34))
#define ADC1_JSQR        (*(volatile unsigned long *)(ADC1_BASE+0x38))
#define ADC1_JDR1        (*(volatile unsigned long *)(ADC1_BASE+0x3C))
#define ADC1_JDR2        (*(volatile unsigned long *)(ADC1_BASE+0x40))
#define ADC1_JDR3        (*(volatile unsigned long *)(ADC1_BASE+0x44))
#define ADC1_JDR4        (*(volatile unsigned long *)(ADC1_BASE+0x48))
#define ADC1_DR          (*(volatile unsigned long *)(ADC1_BASE+0x4C))

//------------------ADC2转换---------------------

#define ADC2_SR          (*(volatile unsigned long *)(ADC2_BASE+0x00))
#define ADC2_CR1         (*(volatile unsigned long *)(ADC2_BASE+0x04))
#define ADC2_CR2         (*(volatile unsigned long *)(ADC2_BASE+0x08))
#define ADC2_SMPR1       (*(volatile unsigned long *)(ADC2_BASE+0x0C))
#define ADC2_SMPR2       (*(volatile unsigned long *)(ADC2_BASE+0x10))
#define ADC2_JOFR1       (*(volatile unsigned long *)(ADC2_BASE+0x14))
#define ADC2_JOFR2       (*(volatile unsigned long *)(ADC2_BASE+0x18))
#define ADC2_JOFR3       (*(volatile unsigned long *)(ADC2_BASE+0x1C))
#define ADC2_JOFR4       (*(volatile unsigned long *)(ADC2_BASE+0x20))
#define ADC2_HTR         (*(volatile unsigned long *)(ADC2_BASE+0x24))
#define ADC2_LTR         (*(volatile unsigned long *)(ADC2_BASE+0x28))
#define ADC2_SQR1        (*(volatile unsigned long *)(ADC2_BASE+0x2C))
#define ADC2_SQR2        (*(volatile unsigned long *)(ADC2_BASE+0x30))
#define ADC2_SQR3        (*(volatile unsigned long *)(ADC2_BASE+0x34))
#define ADC2_JSQR        (*(volatile unsigned long *)(ADC2_BASE+0x38))
#define ADC2_JDR1        (*(volatile unsigned long *)(ADC2_BASE+0x3C))
#define ADC2_JDR2        (*(volatile unsigned long *)(ADC2_BASE+0x40))
#define ADC2_JDR3        (*(volatile unsigned long *)(ADC2_BASE+0x44))
#define ADC2_JDR4        (*(volatile unsigned long *)(ADC2_BASE+0x48))
#define ADC2_DR          (*(volatile unsigned long *)(ADC2_BASE+0x4C))


//-------------SPI---------------------------------------
#define  SPI1_CR1      (*(volatile unsigned long *)(SPI1_BASE+0x00))
#define  SPI1_CR2      (*(volatile unsigned long *)(SPI1_BASE+0x04))
#define  SPI1_SR       (*(volatile unsigned long *)(SPI1_BASE+0x08))
#define  SPI1_DR   	   (*(volatile unsigned long *)(SPI1_BASE+0x0C))
#define  SPI1_CRCPR    (*(volatile unsigned long *)(SPI1_BASE+0x10))
#define  SPI1_RXCRCR   (*(volatile unsigned long *)(SPI1_BASE+0x14))
#define  SPI1_TXCRR    (*(volatile unsigned long *)(SPI1_BASE+0x18))
#define  SPI1_I2S_CFGR (*(volatile unsigned long *)(SPI1_BASE+0x1C))
#define  SPI1_I2SPR    (*(volatile unsigned long *)(SPI1_BASE+0x20))

#define  SPI2_CR1      (*(volatile unsigned long *)(SPI2_BASE+0x00))
#define  SPI2_CR2      (*(volatile unsigned long *)(SPI2_BASE+0x04))
#define  SPI2_SR       (*(volatile unsigned long *)(SPI2_BASE+0x08))
#define  SPI2_DR   	   (*(volatile unsigned long *)(SPI2_BASE+0x0C))
#define  SPI2_CRCPR    (*(volatile unsigned long *)(SPI2_BASE+0x10))
#define  SPI2_RXCRCR   (*(volatile unsigned long *)(SPI2_BASE+0x14))
#define  SPI2_TXCRR    (*(volatile unsigned long *)(SPI2_BASE+0x18))
#define  SPI2_I2S_CFGR (*(volatile unsigned long *)(SPI2_BASE+0x1C))
#define  SPI2_I2SPR    (*(volatile unsigned long *)(SPI2_BASE+0x20))


#define  SPI3_CR1      (*(volatile unsigned long *)(SPI3_BASE+0x00))
#define  SPI3_CR2      (*(volatile unsigned long *)(SPI3_BASE+0x04))
#define  SPI3_SR       (*(volatile unsigned long *)(SPI3_BASE+0x08))
#define  SPI3_DR   	   (*(volatile unsigned long *)(SPI3_BASE+0x0C))
#define  SPI3_CRCPR    (*(volatile unsigned long *)(SPI3_BASE+0x10))
#define  SPI3_RXCRCR   (*(volatile unsigned long *)(SPI3_BASE+0x14))
#define  SPI3_TXCRR    (*(volatile unsigned long *)(SPI3_BASE+0x18))
#define  SPI3_I2S_CFGR (*(volatile unsigned long *)(SPI3_BASE+0x1C))
#define  SPI3_I2SPR    (*(volatile unsigned long *)(SPI3_BASE+0x20))


//------------------------SD卡相关寄存器------------------------
#define  SDIO_POWER    (*(volatile unsigned long *)(SDIO_BASE+0x00))
#define  SDIO_CLKCR    (*(volatile unsigned long *)(SDIO_BASE+0x04))
#define  SDIO_ARG      (*(volatile unsigned long *)(SDIO_BASE+0x08))
#define  SDIO_CMD      (*(volatile unsigned long *)(SDIO_BASE+0x0C))
#define  SDIO_RESPCMD  (*(volatile unsigned long *)(SDIO_BASE+0x10))
#define  SDIO_RESP1    (*(volatile unsigned long *)(SDIO_BASE+0x14))
#define  SDIO_RESP2    (*(volatile unsigned long *)(SDIO_BASE+0x18))
#define  SDIO_RESP3    (*(volatile unsigned long *)(SDIO_BASE+0x1C))
#define  SDIO_RESP4    (*(volatile unsigned long *)(SDIO_BASE+0x20))
#define  SDIO_DTIMER   (*(volatile unsigned long *)(SDIO_BASE+0x24))
#define  SDIO_DLEN     (*(volatile unsigned long *)(SDIO_BASE+0x28))
#define  SDIO_DCTRL    (*(volatile unsigned long *)(SDIO_BASE+0x2C))
#define  SDIO_DCOUNT   (*(volatile unsigned long *)(SDIO_BASE+0x30))
#define  SDIO_STA      (*(volatile unsigned long *)(SDIO_BASE+0x34))
#define  SDIO_ICR      (*(volatile unsigned long *)(SDIO_BASE+0x38))
#define  SDIO_MASK     (*(volatile unsigned long *)(SDIO_BASE+0x3C))
#define  SDIO_FIFOCNT  (*(volatile unsigned long *)(SDIO_BASE+0x48))
#define  SDIO_FIFO     (*(volatile unsigned long *)(SDIO_BASE+0x80))

//--------------------------FSMC控制寄存器----------------------//
//----NOD Flash,SRAM 控制器
#define  FSMC_BCR1   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x00))
#define  FSMC_BTR1   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x04))

