wsmitpwtind/Buaa_QiXian_Cup/stm32_lib/stm32f10x_Reg.h
#define  FSMC_BCR2   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x08))
#define  FSMC_BTR2   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x0c))

#define  FSMC_BCR3   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x10))
#define  FSMC_BTR3   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x14))

#define  FSMC_BCR4   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x18))
#define  FSMC_BTR4   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x1c))

#define  FSMC_BWTR1  (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x0104))
#define  FSMC_BWTR2  (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x010C))
#define  FSMC_BWTR3  (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x0114))
#define  FSMC_BWTR4  (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x011C))


//----NAND Flash 控制器
#define  FSMC_PCR2   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x60))
#define  FSMC_SC2    (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x64))
#define  FSMC_PMEM2  (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x68))
#define  FSMC_PATT2  (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x6C))

#define  FSMC_PCR3   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x80))
#define  FSMC_SR3    (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x84))
#define  FSMC_PMEM3  (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x88))
#define  FSMC_PATT3  (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0x8C))

#define  FSMC_PCR4   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0xA0))
#define  FSMC_SR4    (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0xA4))
#define  FSMC_PMEM4  (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0xA8))
#define  FSMC_PATT4  (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0xAC))
#define  FSMC_PIO4   (*(volatile unsigned long *)(FSMC_Bank1_R_BASE+0xB0))

//--------------------------定时器相关-----------------------------------

#define  TIM1_CR1    (*(volatile unsigned long *)(TIM1_BASE+0x00))
#define  TIM1_CR2    (*(volatile unsigned long *)(TIM1_BASE+0x04))
#define  TIM1_SMCR   (*(volatile unsigned long *)(TIM1_BASE+0x08))
#define  TIM1_DIER   (*(volatile unsigned long *)(TIM1_BASE+0x0C))
#define  TIM1_SR     (*(volatile unsigned long *)(TIM1_BASE+0x10))
#define  TIM1_EGR    (*(volatile unsigned long *)(TIM1_BASE+0x14))
#define  TIM1_CCMR1  (*(volatile unsigned long *)(TIM1_BASE+0x18))
#define  TIM1_CCMR2  (*(volatile unsigned long *)(TIM1_BASE+0x1C))
#define  TIM1_CCER   (*(volatile unsigned long *)(TIM1_BASE+0x20))
#define  TIM1_CNT    (*(volatile unsigned long *)(TIM1_BASE+0x24))
#define  TIM1_PSC    (*(volatile unsigned long *)(TIM1_BASE+0x28))
#define  TIM1_ARR    (*(volatile unsigned long *)(TIM1_BASE+0x2C))
#define  TIM1_RCR    (*(volatile unsigned long *)(TIM1_BASE+0x30))
#define  TIM1_CCR1   (*(volatile unsigned long *)(TIM1_BASE+0x34))
#define  TIM1_CCR2   (*(volatile unsigned long *)(TIM1_BASE+0x38))
#define  TIM1_CCR3   (*(volatile unsigned long *)(TIM1_BASE+0x3C))
#define  TIM1_CCR4   (*(volatile unsigned long *)(TIM1_BASE+0x40))
#define  TIM1_BDTR   (*(volatile unsigned long *)(TIM1_BASE+0x44))
#define  TIM1_DCR    (*(volatile unsigned long *)(TIM1_BASE+0x48))
#define  TIM1_DMAR   (*(volatile unsigned long *)(TIM1_BASE+0x4C))


#define  TIM2_CR1    (*(volatile unsigned long *)(TIM2_BASE+0x00))
#define  TIM2_CR2    (*(volatile unsigned long *)(TIM2_BASE+0x04))
#define  TIM2_SMCR   (*(volatile unsigned long *)(TIM2_BASE+0x08))
#define  TIM2_DIER   (*(volatile unsigned long *)(TIM2_BASE+0x0C))
#define  TIM2_SR     (*(volatile unsigned long *)(TIM2_BASE+0x10))
#define  TIM2_EGR    (*(volatile unsigned long *)(TIM2_BASE+0x14))
#define  TIM2_CCMR1  (*(volatile unsigned long *)(TIM2_BASE+0x18))
#define  TIM2_CCMR2  (*(volatile unsigned long *)(TIM2_BASE+0x1C))
#define  TIM2_CCER   (*(volatile unsigned long *)(TIM2_BASE+0x20))
#define  TIM2_CNT    (*(volatile unsigned long *)(TIM2_BASE+0x24))
#define  TIM2_PSC    (*(volatile unsigned long *)(TIM2_BASE+0x28))
#define  TIM2_ARR    (*(volatile unsigned long *)(TIM2_BASE+0x2C))
#define  TIM2_CCR1   (*(volatile unsigned long *)(TIM2_BASE+0x34))
#define  TIM2_CCR2   (*(volatile unsigned long *)(TIM2_BASE+0x38))
#define  TIM2_CCR3   (*(volatile unsigned long *)(TIM2_BASE+0x3C))
#define  TIM2_CCR4   (*(volatile unsigned long *)(TIM2_BASE+0x40))
#define  TIM2_DCR    (*(volatile unsigned long *)(TIM2_BASE+0x48))
#define  TIM2_DMAR   (*(volatile unsigned long *)(TIM2_BASE+0x4C))

#define  TIM3_CR1    (*(volatile unsigned long *)(TIM3_BASE+0x00))
#define  TIM3_CR2    (*(volatile unsigned long *)(TIM3_BASE+0x04))
#define  TIM3_SMCR   (*(volatile unsigned long *)(TIM3_BASE+0x08))
#define  TIM3_DIER   (*(volatile unsigned long *)(TIM3_BASE+0x0C))
#define  TIM3_SR     (*(volatile unsigned long *)(TIM3_BASE+0x10))
#define  TIM3_EGR    (*(volatile unsigned long *)(TIM3_BASE+0x14))
#define  TIM3_CCMR1  (*(volatile unsigned long *)(TIM3_BASE+0x18))
#define  TIM3_CCMR2  (*(volatile unsigned long *)(TIM3_BASE+0x1C))
#define  TIM3_CCER   (*(volatile unsigned long *)(TIM3_BASE+0x20))
#define  TIM3_CNT    (*(volatile unsigned long *)(TIM3_BASE+0x24))
#define  TIM3_PSC    (*(volatile unsigned long *)(TIM3_BASE+0x28))
#define  TIM3_ARR    (*(volatile unsigned long *)(TIM3_BASE+0x2C))
#define  TIM3_CCR1   (*(volatile unsigned long *)(TIM3_BASE+0x34))
#define  TIM3_CCR2   (*(volatile unsigned long *)(TIM3_BASE+0x38))
#define  TIM3_CCR3   (*(volatile unsigned long *)(TIM3_BASE+0x3C))
#define  TIM3_CCR4   (*(volatile unsigned long *)(TIM3_BASE+0x40))
#define  TIM3_DCR    (*(volatile unsigned long *)(TIM3_BASE+0x48))
#define  TIM3_DMAR   (*(volatile unsigned long *)(TIM3_BASE+0x4C))

#define  TIM4_CR1    (*(volatile unsigned long *)(TIM4_BASE+0x00))
#define  TIM4_CR2    (*(volatile unsigned long *)(TIM4_BASE+0x04))
#define  TIM4_SMCR   (*(volatile unsigned long *)(TIM4_BASE+0x08))
#define  TIM4_DIER   (*(volatile unsigned long *)(TIM4_BASE+0x0C))
#define  TIM4_SR     (*(volatile unsigned long *)(TIM4_BASE+0x10))
#define  TIM4_EGR    (*(volatile unsigned long *)(TIM4_BASE+0x14))
#define  TIM4_CCMR1  (*(volatile unsigned long *)(TIM4_BASE+0x18))
#define  TIM4_CCMR2  (*(volatile unsigned long *)(TIM4_BASE+0x1C))
#define  TIM4_CCER   (*(volatile unsigned long *)(TIM4_BASE+0x20))
#define  TIM4_CNT    (*(volatile unsigned long *)(TIM4_BASE+0x24))
#define  TIM4_PSC    (*(volatile unsigned long *)(TIM4_BASE+0x28))
#define  TIM4_ARR    (*(volatile unsigned long *)(TIM4_BASE+0x2C))
#define  TIM4_CCR1   (*(volatile unsigned long *)(TIM4_BASE+0x34))
#define  TIM4_CCR2   (*(volatile unsigned long *)(TIM4_BASE+0x38))
#define  TIM4_CCR3   (*(volatile unsigned long *)(TIM4_BASE+0x3C))
#define  TIM4_CCR4   (*(volatile unsigned long *)(TIM4_BASE+0x40))
#define  TIM4_DCR    (*(volatile unsigned long *)(TIM4_BASE+0x48))
#define  TIM4_DMAR   (*(volatile unsigned long *)(TIM4_BASE+0x4C))


#define  TIM5_CR1    (*(volatile unsigned long *)(TIM5_BASE+0x00))
#define  TIM5_CR2    (*(volatile unsigned long *)(TIM5_BASE+0x04))
#define  TIM5_SMCR   (*(volatile unsigned long *)(TIM5_BASE+0x08))
#define  TIM5_DIER   (*(volatile unsigned long *)(TIM5_BASE+0x0C))
#define  TIM5_SR     (*(volatile unsigned long *)(TIM5_BASE+0x10))
#define  TIM5_EGR    (*(volatile unsigned long *)(TIM5_BASE+0x14))
#define  TIM5_CCMR1  (*(volatile unsigned long *)(TIM5_BASE+0x18))
#define  TIM5_CCMR2  (*(volatile unsigned long *)(TIM5_BASE+0x1C))
#define  TIM5_CCER   (*(volatile unsigned long *)(TIM5_BASE+0x20))
#define  TIM5_CNT    (*(volatile unsigned long *)(TIM5_BASE+0x24))
#define  TIM5_PSC    (*(volatile unsigned long *)(TIM5_BASE+0x28))
#define  TIM5_ARR    (*(volatile unsigned long *)(TIM5_BASE+0x2C))
#define  TIM5_CCR1   (*(volatile unsigned long *)(TIM5_BASE+0x34))
#define  TIM5_CCR2   (*(volatile unsigned long *)(TIM5_BASE+0x38))
#define  TIM5_CCR3   (*(volatile unsigned long *)(TIM5_BASE+0x3C))
#define  TIM5_CCR4   (*(volatile unsigned long *)(TIM5_BASE+0x40))
#define  TIM5_DCR    (*(volatile unsigned long *)(TIM5_BASE+0x48))
#define  TIM5_DMAR   (*(volatile unsigned long *)(TIM5_BASE+0x4C))

//----------------DAC转换---------------
#define DAC_CR           (*(volatile unsigned long *)(DAC_BASE+0x00))
#define DAC_SWTRIGR      (*(volatile unsigned long *)(DAC_BASE+0x04))
#define DAC_DHR12R1      (*(volatile unsigned long *)(DAC_BASE+0x08))
#define DAC_DHR12L1      (*(volatile unsigned long *)(DAC_BASE+0x0C))
#define DAC_DHR8R1       (*(volatile unsigned long *)(DAC_BASE+0x10))

#define DAC_DHR12R2       (*(volatile unsigned long *)(DAC_BASE+0x14))
#define DAC_DHR12L2       (*(volatile unsigned long *)(DAC_BASE+0x18))
#define DAC_DHR8R2        (*(volatile unsigned long *)(DAC_BASE+0x1C))
	
#define DAC_DHR12RD       (*(volatile unsigned long *)(DAC_BASE+0x20))
#define DAC_DHR12LD       (*(volatile unsigned long *)(DAC_BASE+0x24))
#define DAC_DHR8RD        (*(volatile unsigned long *)(DAC_BASE+0x28))

#define DAC_DOR1       	 (*(volatile unsigned long *)(DAC_BASE+0x2C))
#define DAC_DOR2         (*(volatile unsigned long *)(DAC_BASE+0x30))

 
//IO口操作,只对单一的IO口!
//确保n的值小于16!
#define PAout(n)   BIT_ADDR (GPIOA_ODR_Addr,n)  //输出 
#define PAin(n)    BIT_ADDR (GPIOA_IDR_Addr,n)  //输入 

#define PBout(n)   BIT_ADDR (GPIOB_ODR_Addr,n)  //输出 
#define PBin(n)    BIT_ADDR (GPIOB_IDR_Addr,n)  //输入 

#define PCout(n)   BIT_ADDR (GPIOC_ODR_Addr,n)  //输出 
#define PCin(n)    BIT_ADDR (GPIOC_IDR_Addr,n)  //输入 

#define PDout(n)   BIT_ADDR (GPIOD_ODR_Addr,n)  //输出 
#define PDin(n)    BIT_ADDR (GPIOD_IDR_Addr,n)  //输入 

#define PEout(n)   BIT_ADDR (GPIOE_ODR_Addr,n)  //输出 
#define PEin(n)    BIT_ADDR (GPIOE_IDR_Addr,n)  //输入

