wsmitpwtind/Buaa_QiXian_Cup/stm32_lib/stm32f10x_Reg.h
#define PFout(n)   BIT_ADDR (GPIOF_ODR_Addr,n)  //输出 
#define PFin(n)    BIT_ADDR (GPIOF_IDR_Addr,n)  //输入

#define PGout(n)   BIT_ADDR (GPIOG_ODR_Addr,n)  //输出 
#define PGin(n)    BIT_ADDR (GPIOG_IDR_Addr,n)  //输入


//---------------对其他的的GPIO控制寄存器未操作，如输入、输出模式操作----------------

#define PA_modeH(n)   BIT_ADDR(GPIOA_CRH_Addr,n) 
#define PA_modeL(n)   BIT_ADDR(GPIOA_CRL_Addr,n) 

#define PB_modeH(n)   BIT_ADDR(GPIOB_CRH_Addr,n) 
#define PB_modeL(n)   BIT_ADDR(GPIOB_CRL_Addr,n) 

#define PC_modeH(n)   BIT_ADDR(GPIOC_CRH_Addr,n) 
#define PC_modeL(n)   BIT_ADDR(GPIOC_CRL_Addr,n) 

#define PD_modeH(n)   BIT_ADDR(GPIOD_CRH_Addr,n) 
#define PD_modeL(n)   BIT_ADDR(GPIOD_CRL_Addr,n) 

#define PE_modeH(n)   BIT_ADDR(GPIOE_CRH_Addr,n) 
#define PE_modeL(n)   BIT_ADDR(GPIOE_CRL_Addr,n) 

#define PF_modeH(n)   BIT_ADDR(GPIOF_CRH_Addr,n) 
#define PF_modeL(n)   BIT_ADDR(GPIOF_CRL_Addr,n) 

#define PG_modeH(n)   BIT_ADDR(GPIOG_CRH_Addr,n) 
#define PG_modeL(n)   BIT_ADDR(GPIOG_CRL_Addr,n) 


/*-------神舟开发板上外部LCD操作----选用了BANK1的第4个FSMC，64M--------*/


#define BIT15  15
#define BIT14  14
#define BIT13  13
#define BIT12  12
#define BIT11  11
#define BIT10  10
#define BIT9   9
#define BIT8   8
#define BIT7   7
#define BIT6   6
#define BIT5   5
#define BIT4   4
#define BIT3   3
#define BIT2   2
#define BIT1   1
#define BIT0   0

#define PortA 0
#define PortB 1
#define PortC 2
#define PortD 3
#define PortE 4
#define PortF 5
#define PortG 6



//--------------------------片内资源时钟使能---------------------

//--------------------------AHB总线
#define SckEn_DMA1  0
#define SckEn_DMA2	1
#define SckEn_SRAM	2
#define SckEn_FLITF	4
#define SckEn_CRC	6
#define SckEn_FSMC	8
#define SckEn_SDIO	10

//--------------------------APB2总线
#define SckEn_AFIO	 0+0x40
#define SckEn_GPIOA	 2+0x40
#define SckEn_GPIOB	 3+0x40
#define SckEn_GPIOC	 4+0x40
#define SckEn_GPIOD	 5+0x40
#define SckEn_GPIOE	 6+0x40
#define SckEn_GPIOF	 7+0x40
#define SckEn_GPIOG	 8+0x40
#define SckEn_ADC1	 9+0x40
#define SckEn_ADC2	 10+0x40
#define SckEn_TIM1	 11+0x40
#define SckEn_SPI1	 12+0x40
#define SckEn_TIM8	 13+0x40
#define SckEn_USART1 14+0x40
#define SckEn_ADC3	 15+0x40

//--------------------------APB1总线
#define SckEn_TIM2	0+0x80
#define SckEn_TIM3	1+0x80
#define SckEn_TIM4	2+0x80
#define SckEn_TIM5	3+0x80
#define SckEn_TIM6	4+0x80
#define SckEn_TIM7	5+0x80
#define SckEn_WWDG  11+0x80

#define SckEn_SPI2   14+0x80
#define SckEn_SPI3   15+0x80
#define SckEn_USART2 17+0x80
#define SckEn_USART3 18+0x80
#define SckEn_USART4 19+0x80
#define SckEn_USART5 20+0x80
#define SckEn_I2C1   21+0x80
#define SckEn_I2C2	 22+0x80
#define SckEn_USB    23+0x80
#define SckEn_CAN    25+0x80
#define SckEn_BKP    27+0x80
#define SckEn_PWR    28+0x80
#define SckEn_DAC    29+0x80

#define GE_TW_2M   0x02
#define GE_TW_10M  0x01
#define GE_TW_50M  0x03

#define GE_OC_2M   0x06
#define GE_OC_10M  0x05
#define GE_OC_50M  0x07

#define AF_TW_2M   0x0a
#define AF_TW_10M  0x09
#define AF_TW_50M  0x0b

#define AF_OC_2M   0x0E
#define AF_OC_10M  0x0D
#define AF_OC_50M  0x0F

#define Analog_IN  0x00
#define Suspen_IN  0x04
#define Updown_IN  0x08


//-------------中断号定义--------------------

#define WWDG_IRQChannel              ((u8)0x00)  /* Window WatchDog Interrupt */
#define PVD_IRQChannel               ((u8)0x01)  /* PVD through EXTI Line detection Interrupt */
#define TAMPER_IRQChannel            ((u8)0x02)  /* Tamper Interrupt */
#define RTC_IRQChannel               ((u8)0x03)  /* RTC global Interrupt */
#define FLASH_IRQChannel             ((u8)0x04)  /* FLASH global Interrupt */
#define RCC_IRQChannel               ((u8)0x05)  /* RCC global Interrupt */
#define EXTI0_IRQChannel             ((u8)0x06)  /* EXTI Line0 Interrupt */
#define EXTI1_IRQChannel             ((u8)0x07)  /* EXTI Line1 Interrupt */
#define EXTI2_IRQChannel             ((u8)0x08)  /* EXTI Line2 Interrupt */
#define EXTI3_IRQChannel             ((u8)0x09)  /* EXTI Line3 Interrupt */
#define EXTI4_IRQChannel             ((u8)0x0A)  /* EXTI Line4 Interrupt */
#define DMA1_Channel1_IRQChannel     ((u8)0x0B)  /* DMA1 Channel 1 global Interrupt */
#define DMA1_Channel2_IRQChannel     ((u8)0x0C)  /* DMA1 Channel 2 global Interrupt */
#define DMA1_Channel3_IRQChannel     ((u8)0x0D)  /* DMA1 Channel 3 global Interrupt */
#define DMA1_Channel4_IRQChannel     ((u8)0x0E)  /* DMA1 Channel 4 global Interrupt */
#define DMA1_Channel5_IRQChannel     ((u8)0x0F)  /* DMA1 Channel 5 global Interrupt */
#define DMA1_Channel6_IRQChannel     ((u8)0x10)  /* DMA1 Channel 6 global Interrupt */
#define DMA1_Channel7_IRQChannel     ((u8)0x11)  /* DMA1 Channel 7 global Interrupt */
#define ADC1_2_IRQChannel            ((u8)0x12)  /* ADC1 et ADC2 global Interrupt */
#define USB_HP_CAN_TX_IRQChannel     ((u8)0x13)  /* USB High Priority or CAN TX Interrupts */
#define USB_LP_CAN_RX0_IRQChannel    ((u8)0x14)  /* USB Low Priority or CAN RX0 Interrupts */
#define CAN_RX1_IRQChannel           ((u8)0x15)  /* CAN RX1 Interrupt */
#define CAN_SCE_IRQChannel           ((u8)0x16)  /* CAN SCE Interrupt */
#define EXTI9_5_IRQChannel           ((u8)0x17)  /* External Line[9:5] Interrupts */
#define TIM1_BRK_IRQChannel          ((u8)0x18)  /* TIM1 Break Interrupt */
#define TIM1_UP_IRQChannel           ((u8)0x19)  /* TIM1 Update Interrupt */
#define TIM1_TRG_COM_IRQChannel      ((u8)0x1A)  /* TIM1 Trigger and Commutation Interrupt */
#define TIM1_CC_IRQChannel           ((u8)0x1B)  /* TIM1 Capture Compare Interrupt */
#define TIM2_IRQChannel              ((u8)0x1C)  /* TIM2 global Interrupt */
#define TIM3_IRQChannel              ((u8)0x1D)  /* TIM3 global Interrupt */
#define TIM4_IRQChannel              ((u8)0x1E)  /* TIM4 global Interrupt */
#define I2C1_EV_IRQChannel           ((u8)0x1F)  /* I2C1 Event Interrupt */
#define I2C1_ER_IRQChannel           ((u8)0x20)  /* I2C1 Error Interrupt */
#define I2C2_EV_IRQChannel           ((u8)0x21)  /* I2C2 Event Interrupt */
#define I2C2_ER_IRQChannel           ((u8)0x22)  /* I2C2 Error Interrupt */
#define SPI1_IRQChannel              ((u8)0x23)  /* SPI1 global Interrupt */
#define SPI2_IRQChannel              ((u8)0x24)  /* SPI2 global Interrupt */
#define USART1_IRQChannel            ((u8)0x25)  /* USART1 global Interrupt */
#define USART2_IRQChannel            ((u8)0x26)  /* USART2 global Interrupt */
#define USART3_IRQChannel            ((u8)0x27)  /* USART3 global Interrupt */
#define EXTI15_10_IRQChannel         ((u8)0x28)  /* External Line[15:10] Interrupts */
#define RTCAlarm_IRQChannel          ((u8)0x29)  /* RTC Alarm through EXTI Line Interrupt */
#define USBWakeUp_IRQChannel         ((u8)0x2A)  /* USB WakeUp from suspend through EXTI Line Interrupt */
#define TIM8_BRK_IRQChannel          ((u8)0x2B)  /* TIM8 Break Interrupt */
#define TIM8_UP_IRQChannel           ((u8)0x2C)  /* TIM8 Update Interrupt */
#define TIM8_TRG_COM_IRQChannel      ((u8)0x2D)  /* TIM8 Trigger and Commutation Interrupt */
#define TIM8_CC_IRQChannel           ((u8)0x2E)  /* TIM8 Capture Compare Interrupt */
#define ADC3_IRQChannel              ((u8)0x2F)  /* ADC3 global Interrupt */
#define FSMC_IRQChannel              ((u8)0x30)  /* FSMC global Interrupt */
#define SDIO_IRQChannel              ((u8)0x31)  /* SDIO global Interrupt */
#define TIM5_IRQChannel              ((u8)0x32)  /* TIM5 global Interrupt */
#define SPI3_IRQChannel              ((u8)0x33)  /* SPI3 global Interrupt */
#define UART4_IRQChannel             ((u8)0x34)  /* UART4 global Interrupt */
#define UART5_IRQChannel             ((u8)0x35)  /* UART5 global Interrupt */
#define TIM6_IRQChannel              ((u8)0x36)  /* TIM6 global Interrupt */
#define TIM7_IRQChannel              ((u8)0x37)  /* TIM7 global Interrupt */
#define DMA2_Channel1_IRQChannel     ((u8)0x38)  /* DMA2 Channel 1 global Interrupt */
#define DMA2_Channel2_IRQChannel     ((u8)0x39)  /* DMA2 Channel 2 global Interrupt */
#define DMA2_Channel3_IRQChannel     ((u8)0x3A)  /* DMA2 Channel 3 global Interrupt */
#define DMA2_Channel4_5_IRQChannel   ((u8)0x3B)  /* DMA2 Channel 4 and DMA2 Channel 5 global Interrupt */

#endif 



